# Project Data Wrangling and Retrieval

IMPORTING THE LIBRARIES AND THE DATA INTO A PANDAS DATAFRAME

In [2]:
import pandas as pd
import numpy as np

df = pd.read_csv("Prices-Beef-EU-European-Commision.csv")

# 2. DATA CLEANING & STANDARDADIZATION

# 2.1 Descriptive Analysis

In [3]:
df.head()

,memberStateCode,memberStateName,beginDate,endDate,price,unit,weekNumber,category,productCode
0,AT,Austria,09/02/2026,15/02/2026,€503.03,€/100Kg,7,Young cattle,ZO2
1,AT,Austria,09/02/2026,15/02/2026,€719.55,€/100Kg,7,Heifers,EU2
2,AT,Austria,09/02/2026,15/02/2026,€541.22,€/100Kg,7,Cows,DP3
3,AT,Austria,09/02/2026,15/02/2026,€800.77,€/100Kg,7,Young cattle,ZU3
4,AT,Austria,09/02/2026,15/02/2026,€719.85,€/100Kg,7,Steers,CO3

In [4]:
df.dtypes

memberStateCode    object
memberStateName    object
beginDate          object
endDate            object
price              object
unit               object
weekNumber          int64
category           object
productCode        object
dtype: object

In [5]:
df["unit"].unique()

array(['€/100Kg'], dtype=object)

In [6]:
# formating endDate from object to time
df["endDate"] = pd.to_datetime(df["endDate"], errors="coerce")

C:\Users\eymem\AppData\Local\Temp\ipykernel_19504\199835664.py:2: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df["endDate"] = pd.to_datetime(df["endDate"], errors="coerce")

In [7]:
# New year column
df['year'] = pd.to_datetime(df['endDate']).dt.year

In [8]:
df.head()

,memberStateCode,memberStateName,beginDate,endDate,price,unit,weekNumber,category,productCode,year
0,AT,Austria,09/02/2026,2026-02-15,€503.03,€/100Kg,7,Young cattle,ZO2,2026
1,AT,Austria,09/02/2026,2026-02-15,€719.55,€/100Kg,7,Heifers,EU2,2026
2,AT,Austria,09/02/2026,2026-02-15,€541.22,€/100Kg,7,Cows,DP3,2026
3,AT,Austria,09/02/2026,2026-02-15,€800.77,€/100Kg,7,Young cattle,ZU3,2026
4,AT,Austria,09/02/2026,2026-02-15,€719.85,€/100Kg,7,Steers,CO3,2026

In [9]:
df["year"].value_counts().sort_index()

year
1991    11161
1992    11191
1993    11054
1994    10996
1995    14243
1996    14702
1997    14581
1998    14740
1999    14682
2000    16430
2001    16313
2002    16915
2003    17840
2004    23794
2005    10533
2006    19608
2007    29296
2008    29668
2009    29574
2010    30208
2011    30704
2012    31101
2013    31452
2014    36012
2015    37515
2016    37907
2017    38060
2018    35809
2019    36200
2020    35577
2021    35627
2022    35454
2023    35931
2024    33651
2025    33859
2026     5116
Name: count, dtype: int64

In [10]:
df["price"] = (df["price"].str.replace("€", "", regex=False).str.replace(",", "", regex=False).astype(float))

In [11]:
df.describe()

,endDate,price,weekNumber,year
count,887504,887504.000000,887504.000000,887504.000000
mean,2012-04-11 18:42:37.136418304,316.326236,26.549462,2011.779549
min,1991-01-06 00:00:00,0.010000,0.000000,1991.000000
25%,2006-05-28 00:00:00,237.980000,13.000000,2006.000000
50%,2013-10-13 00:00:00,297.020000,27.000000,2013.000000
75%,2019-10-27 00:00:00,373.000000,40.000000,2019.000000
max,2026-02-15 00:00:00,29866.000000,53.000000,2026.000000
std,NaN,115.699555,15.125560,9.195566

In [12]:
df.head()

,memberStateCode,memberStateName,beginDate,endDate,price,unit,weekNumber,category,productCode,year
0,AT,Austria,09/02/2026,2026-02-15,503.03,€/100Kg,7,Young cattle,ZO2,2026
1,AT,Austria,09/02/2026,2026-02-15,719.55,€/100Kg,7,Heifers,EU2,2026
2,AT,Austria,09/02/2026,2026-02-15,541.22,€/100Kg,7,Cows,DP3,2026
3,AT,Austria,09/02/2026,2026-02-15,800.77,€/100Kg,7,Young cattle,ZU3,2026
4,AT,Austria,09/02/2026,2026-02-15,719.85,€/100Kg,7,Steers,CO3,2026

In [13]:
df = df[(df ['year'] >= 2000) & (df['year'] <= 2022)].copy()

In [14]:
df.dtypes

memberStateCode            object
memberStateName            object
beginDate                  object
endDate            datetime64[ns]
price                     float64
unit                       object
weekNumber                  int64
category                   object
productCode                object
year                        int32
dtype: object

In [15]:
df.isna().sum()

memberStateCode    0
memberStateName    0
beginDate          0
endDate            0
price              0
unit               0
weekNumber         0
category           0
productCode        0
year               0
dtype: int64

In [16]:
df["memberStateCode"].value_counts()

memberStateCode
EU    39130
SE    36742
AT    36713
IE    35457
DK    34648
FR    34333
DE    28234
IT    27849
ES    27781
PT    26016
SI    25854
NL    25156
RO    23929
LU    23749
PL    23666
CZ    23191
FI    22647
LV    21377
BE    19816
SK    19803
EL    18951
LT    18038
EE    17882
HU    15312
HR    10488
MT    10208
BG     9404
CY     5223
Name: count, dtype: int64

In [17]:
df["memberStateName"].value_counts()

memberStateName
European Union    39130
Sweden            36742
Austria           36713
Ireland           35457
Denmark           34648
France            34333
Germany           28234
Italy             27849
Spain             27781
Portugal          26016
Slovenia          25854
Netherlands       25156
Romania           23929
Luxembourg        23749
Poland            23666
Czechia           23191
Finland           22647
Latvia            21377
Belgium           19816
Slovakia          19803
Greece            18951
Lithuania         18038
Estonia           17882
Hungary           15312
Croatia           10488
Malta             10208
Bulgaria           9404
Cyprus             5223
Name: count, dtype: int64

In [18]:
df["category"].value_counts()

category
Heifers                        183334
Cows                           178467
Young bulls                    155757
Steers                          64811
Young cattle                    35957
Adult male indicative price     23885
Bulls                           16604
Calves slaughtered <8M           2782
Name: count, dtype: int64

In [19]:
df["productCode"].value_counts()

productCode
AO2                 28295
AO3                 27888
DP2                 27772
DO3                 27225
DO2                 26874
DP3                 26718
AR2                 26247
AR3                 25797
EO3                 25557
ER2                 25065
ER3                 25016
EO2                 24805
DR3                 24512
AU2                 24327
DO4                 24259
ACZURO              23885
AU3                 23203
EO4                 21621
DR4                 21107
ER4                 20604
EU2                 19434
EU3                 19222
BR3                 16604
CO3                 13116
CR3                 12434
CO4                  8884
CR4                  8792
CU3                  8383
ZO2                  7615
CU2                  7113
ZR2                  7036
CU4                  6089
ZR3                  6010
ZO3                  5807
ZU2                  5075
ZU3                  4414
CALVES-LT8MONTHS     2782
EU4                  2010
Name: count, dtype: int64

In [20]:
pd.crosstab(df["memberStateName"], df["category"])

category,Adult male indicative price,Bulls,Calves slaughtered <8M,Cows,Heifers,Steers,Young bulls,Young cattle
memberStateName,,,,,,,,
Austria,1014,1144,0,8036,9255,7947,6888,2429
Belgium,1013,0,424,6899,4592,0,6888,0
Bulgaria,105,245,0,4899,1714,31,2139,271
Croatia,493,165,0,2896,3533,35,2956,410
Cyprus,1,0,0,1842,1579,0,1801,0
Czechia,919,907,0,6440,7073,1821,5522,509
Denmark,1015,1119,0,8036,9261,5515,6888,2814
Estonia,801,497,0,5722,4625,1681,3991,565
European Union,1017,1200,438,8400,9672,8392,7200,2811
Finland,1015,300,0,7030,7476,0,6826,0
France,1015,1128,443,8036,9792,7031,6888,0
Germany,1015,987,443,7392,8364,2425,6888,720
Greece,1012,0,0,5717,4533,11,6769,909
Hungary,583,14,0,6442,5140,0,3133,0
Ireland,1015,999,0,8019,9483,8029,6156,1756
Italy,1015,468,443,6699,7886,1658,6888,2792
Latvia,892,505,0,6359,6267,619,4845,1890
Lithuania,893,822,0,5984,5253,0,5086,0
Luxembourg,1015,341,0,5705,6351,3178,6622,537
Malta,400,323,0,2601,3164,0,3033,687
Netherlands,1012,88,443,8036,7198,55,6884,1440
Poland,919,921,0,6447,7563,110,5526,2180
Portugal,1014,625,44,6443,6544,1728,6888,2730
Romania,825,826,0,5835,6109,3294,4755,2285
Slovakia,918,911,0,6033,5106,827,4995,1013
Slovenia,919,921,104,6447,7365,2748,5526,1824
Spain,1015,0,0,8036,9184,0,6888,2658
Sweden,1015,1148,0,8036,9252,7676,6888,2727

In [21]:
df.groupby(["memberStateName", "year"])['price'].mean().round(2)

memberStateName  year
Austria          2000    241.43
                 2001    204.86
                 2002    225.99
                 2003    227.54
                 2004    230.69
                          ...
Sweden           2018    411.74
                 2019    386.44
                 2020    408.69
                 2021    452.68
                 2022    486.12
Name: price, Length: 577, dtype: float64

In [22]:
price_year = df.groupby(["memberStateName", "year"])['price'].mean().round(2).reset_index()
price_year

    memberStateName  year   price
0           Austria  2000  241.43
1           Austria  2001  204.86
2           Austria  2002  225.99
3           Austria  2003  227.54
4           Austria  2004  230.69
..              ...   ...     ...
572          Sweden  2018  411.74
573          Sweden  2019  386.44
574          Sweden  2020  408.69
575          Sweden  2021  452.68
576          Sweden  2022  486.12

[577 rows x 3 columns]

In [23]:
price_year[price_year["memberStateName"] == "Austria"]["year"].value_counts()

year
2000    1
2001    1
2002    1
2003    1
2004    1
2005    1
2006    1
2007    1
2008    1
2009    1
2010    1
2011    1
2012    1
2013    1
2014    1
2015    1
2016    1
2017    1
2018    1
2019    1
2020    1
2021    1
2022    1
Name: count, dtype: int64

In [24]:
price_year.head()

  memberStateName  year   price
0         Austria  2000  241.43
1         Austria  2001  204.86
2         Austria  2002  225.99
3         Austria  2003  227.54
4         Austria  2004  230.69

In [25]:
pd.crosstab(price_year["year"], price_year["memberStateName"] )

memberStateName,Austria,Belgium,Bulgaria,Croatia,Cyprus,Czechia,Denmark,Estonia,European Union,Finland,...,Luxembourg,Malta,Netherlands,Poland,Portugal,Romania,Slovakia,Slovenia,Spain,Sweden
year,,,,,,,,,,,,,,,,,,,,,
2000,1,1,0,0,0,0,1,0,1,1,...,1,0,1,0,1,0,0,0,1,1
2001,1,1,0,0,0,0,1,0,1,1,...,1,0,1,0,1,0,0,0,1,1
2002,1,1,0,0,0,0,1,0,1,1,...,1,0,1,0,1,0,0,0,1,1
2003,1,1,0,0,0,0,1,0,1,1,...,1,0,1,0,1,0,0,0,1,1
2004,1,1,0,0,1,1,1,1,1,1,...,1,1,1,1,1,0,1,1,1,1
2005,1,1,0,0,1,1,1,1,1,1,...,1,1,1,1,1,0,1,1,1,1
2006,1,1,0,0,1,1,1,1,1,1,...,1,1,1,1,1,0,1,1,1,1
2007,1,1,1,0,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2008,1,1,1,0,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2009,1,1,1,0,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2010,1,1,1,0,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2011,1,1,1,0,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2012,1,1,1,0,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2013,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2014,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2015,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2016,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2017,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2018,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2019,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2020,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2021,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2022,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1

In [26]:
price_year.rename(columns={"memberStateName": "Country", "price": "price €/100Kg"}, inplace=True)

In [27]:
price_year.columns = price_year.columns.str.capitalize()

In [28]:
price_year.head()

   Country  Year  Price €/100kg
0  Austria  2000         241.43
1  Austria  2001         204.86
2  Austria  2002         225.99
3  Austria  2003         227.54
4  Austria  2004         230.69

In [30]:
price_year.to_csv(r"C:\Users\eymem\Documents\GitHub\Project-Beef\price_year.csv",index=False)